admin/app/Controllers/Auth.php

    public function attempt()
    {
        $session = session();

        // Simple brute-force protection (per session)
        $lockedUntil = (int) $session->get('login_locked_until');
        if ($lockedUntil > time()) {
            $mins = (int) ceil(($lockedUntil - time()) / 60);
            return redirect()->back()->with('error', "Too many attempts. Try again in {$mins} minute(s).");
        }

        $rules = [
            'email'    => 'required|valid_email',
            'password' => 'required|min_length[6]',
        ];
        if (! $this->validate($rules)) {
            return redirect()->back()->withInput()->with('error', 'Enter a valid email and a password of 6+ characters.');
        }

        $email = strtolower(trim((string) $this->request->getPost('email')));
        $pass  = (string) $this->request->getPost('password');
        $admin = (new AdminModel())->where('email', $email)->first();
---
SELECT *
FROM `admins`
WHERE `email` = 'admin@gmail.com'
 LIMIT 1