admin/app/Controllers/Careers.php

SELECT COUNT(*) AS `numrows`
FROM `careers`
---
    public function index()
    {
        $q      = trim((string) $this->request->getGet('q'));
        $status = $this->request->getGet('status');

        $this->model->withApplicantCount();
        if ($q !== '') {
            $this->model->groupStart()
                ->like('title', $q)->orLike('department', $q)->orLike('location', $q)
                ->groupEnd();
        }
        if ($status === '0' || $status === '1') {
            $this->model->where('careers.status', (int) $status);
        }

        $items = $this->model->orderBy('careers.id', 'DESC')->paginate(self::PER_PAGE);