admin/app/Controllers/Dashboard.php


        $data = [
            'title'        => 'Dashboard',
            'totalGallery' => $gallery->countAllResults(),
---
SELECT COUNT(*) AS `numrows`
FROM `gallery`