admin/app/Controllers/Responses.php

SELECT `id`, `title`
FROM `careers`
ORDER BY `title`
---
    public function index()
    {
        [$q, $job, $status] = $this->filters();

        $items = $this->model->filtered($q, $job, $status)
                             ->orderBy('applications.id', 'DESC')
                             ->paginate(self::PER_PAGE);
        $pager = $this->model->pager;

        return view('responses/index', [
            'title'    => 'Career responses',
            'items'    => $items,
            'pager'    => $pager,
            'total'    => $pager->getTotal(),
            'from'     => $pager->getTotal() ? ($pager->getCurrentPage() - 1) * self::PER_PAGE + 1 : 0,
            'to'       => min($pager->getCurrentPage() * self::PER_PAGE, $pager->getTotal()),
            'q'        => $q,
            'job'      => $job,
            'status'   => $status,
            'jobs'     => (new CareerModel())->select('id, title')->orderBy('title')->findAll(),